<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of STARFACE UCC Client and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.gridcad.munki.STARFACEUCCClient</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>STARFACE UCC Client</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
			<string>testing</string>
			<string>production</string>
			</array>
			<key>description</key>
			<string>Der STARFACE UCC Client ist mehr als nur eine Software zum Telefonieren. Es ist Ihr neuer Ansatz zu kommunizieren! 
UCC steht für Unified Communication and Collaboration und der Client hilft Ihnen Ihre Erreichbarkeit zu managen, Laufwege zu vermeiden und produktiver zu arbeiten.</string>
			<key>developer</key>
			<string>STARFACE GmbH</string>
			<key>display_name</key>
			<string>STARFACE UCC Client</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

# Install HelperFiles

sudo installer -store -pkg /Applications/STARFACE\ UCC\ Client.app/Contents/Resources/HelperFiles.pkg -target /</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gridcad.download.STARFACEUCCClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
